# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [18]:
# 記得先 Import 正確的套件

import numpy as np
import pandas as pd

In [19]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [20]:
#計算每個不同種類 animal 的 age 的平均數

df.groupby('animal').mean()['age']

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [21]:
#將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序

df.sort_values(by='age', ascending=True).sort_values(by='visits', ascending=False)

  animal  age  visits priority
f    cat  2.0       3       no
b    cat  3.0       3      yes
d    dog  NaN       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
i    dog  7.0       2       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
h    cat  NaN       1      yes

In [22]:
#將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False

df['priority'].replace({'yes':True, 'no':False})

# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.replace.html

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: bool

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [24]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.714407  0.655614  0.467602
1  0.732241  0.649501  0.914796
2  0.201672  0.299884  0.534377
3  0.457395  0.975970  0.941327
4  0.039872  0.584682  0.408376

In [34]:
#每欄平均
df.mean(axis=0)

0    0.429117
1    0.633130
2    0.653296
dtype: float64

In [35]:
#每筆平均
df.mean(axis=1)

0    0.612541
1    0.765513
2    0.345311
3    0.791564
4    0.344310
dtype: float64

In [37]:
#每個數字減去該欄位的平均數
df - df.mean()

          0         1         2
0  0.285289  0.022484 -0.185693
1  0.303124  0.016371  0.261500
2 -0.227446 -0.333246 -0.118919
3  0.028278  0.342840  0.288031
4 -0.389245 -0.048449 -0.244919

In [39]:
#每個數字減去該筆資料的平均數
df-df.mean(axis=1)

          0         1         2   3   4
0  0.101866 -0.109899  0.122291 NaN NaN
1  0.119700 -0.116012  0.569485 NaN NaN
2 -0.410869 -0.465629  0.189066 NaN NaN
3 -0.155146  0.210458  0.596016 NaN NaN
4 -0.572669 -0.180831  0.063065 NaN NaN

In [38]:
#每個數字減去該筆資料的平均數
df.sub(df.mean(axis=1) ,axis=0)

          0         1         2
0  0.101866  0.043073 -0.144939
1 -0.033271 -0.116012  0.149283
2 -0.143639 -0.045427  0.189066
3 -0.334169  0.184406  0.149763
4 -0.304438  0.240372  0.064066

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [28]:
df

          0         1         2
0  0.714407  0.655614  0.467602
1  0.732241  0.649501  0.914796
2  0.201672  0.299884  0.534377
3  0.457395  0.975970  0.941327
4  0.039872  0.584682  0.408376

In [32]:
df.sum(axis=0)

0    2.145587
1    3.165651
2    3.266478
dtype: float64

In [33]:
df.sum(axis=1)

0    1.837623
1    2.296538
2    1.035932
3    2.374692
4    1.032930
dtype: float64

In [29]:
#哪一欄位的資料總合最小
df.sum().argmin()

0

In [30]:
# 哪一筆資料的總合最小 
df.sum(axis=1).argmin()

4